n = int(input('Введите количество элементов:')) #вводим количество элементов
a = [] #создаём пустой список

for i in range(n):          #создаём цикл для добаления элементов в список
    x = float(input('Введите элемент:'))      #вводим число
    a.append(x)             #добавляем число в список

d = float(input('Введите допустимую разницу элементов:'))  #вводим допустимую разницу элементов
count = 0 #создаём счётчик подходящих элементов
total = sum(a) #находим сумму всех элементов списка
left = 0 #создаём начальную сумму элементов слева

for j in range(n):         #создаем цикл и перебираем элементы списка
    right = total - left - a[j]   #находим сумму чисел справа от текущего элемента
    if  abs(left - right) <= d:  #проверяем не превышает ли разница d
        count += 1        #если условие выолняется, то к счётчику прибавляем 1

    left += a[j] #прибавляем текущий элемент к левой части

print(count)  #выводим результат количества таких символов
