m = int(input('Введите количество строк матрицы:'))   #вводим количество строк
n = int(input('Введите количество столбцов матрицы:'))  #вводим количество столбцов 

a = [] #создаем пустой список для строк

for i in range(m): #начинаем заполнять матрицу
    row = []   #создаем пустой список для ввода каждой строки
    for j in range(n):   #заполняем строку числами
        x = int(input('Введите элемент строки:'))  #вводим элемент матрицы
        row.append(x)   #добавляем введенный элемент в список строки
    a.append(row)      #добавляем строку в список для строк

found = False #создаём флаг который показывает найдена ли хотя бы одна седловая точка
for i in range(m):    #перебираем строки матрицы
    for j in range(n):    #перебираем столбцы матрицы
        max_row = max(a[i])  #находим максимальное значение строки
        min_row = min(a[i])   #находим минимальное значение строки
        col = []              #создаем пустой список для столбцов
        for k in range(m):     #снова перебираем строки для создания столбца
            col.append(a[k][j])  #добавляем элементы в столбец
        max_col = max(col)        #находим максимальный элемент столбца
        min_col = min(col)        #находим минимальный элемент столбца

        #проверяем является ли элемент максимальным в строке и минимальным в столбце и наооборот
        if (a[i][j] == max_row and a[i][j] == min_col) or (a[i][j] == min_row and a[i][j] == max_col):
            print('Седловая точка:', a[i][j])   #если условие выполняется, значит мы нашли седловую точку, выводим
            found = True  #меняем флаг, так как седловая точка найдена

if found == False:
    print('Седловых точек нет')
